In [49]:
import pandas as pd
import numpy as np

In [50]:
dff = pd.read_csv("E:\PES\SEM2\Refer\ML\ML_Datasets-20230613T052137Z-001\ML_Datasets\Salaries.csv")

In [51]:
dff['salary'].dtype

dtype('int64')

In [52]:
dff.shape

(397, 7)

In [53]:
dff.ndim

2

In [54]:
dff.columns

Index(['index', 'rank', 'discipline', 'yrs.since.phd', 'yrs.service', 'sex',
       'salary'],
      dtype='object')

In [55]:
dff.rename(columns={'salary':'Salary'},inplace=True)

In [57]:
dff.columns = dff.columns.map(lambda x : x.capitalize())

In [58]:
c = dff['Index']

In [59]:
del dff['Index']

In [60]:
dff.insert(loc=0,column="Index",value=c)

In [61]:
f = d =dff.drop(columns="Index")

In [62]:
d['index'] = c

In [63]:
f.insert(0,"Index",c)

In [64]:
arr = np.array([range(50)])

In [65]:
arr

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15,
        16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,
        32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47,
        48, 49]])

In [66]:
arr.reshape(-1,5)

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24],
       [25, 26, 27, 28, 29],
       [30, 31, 32, 33, 34],
       [35, 36, 37, 38, 39],
       [40, 41, 42, 43, 44],
       [45, 46, 47, 48, 49]])

In [67]:
a = [1,2,3,4]
df = pd.DataFrame(a)
df

   0
0  1
1  2
2  3
3  4

In [68]:
pd.Series(a)

0    1
1    2
2    3
3    4
dtype: int64

In [69]:
a = [[[1],1,2,3,4]]

In [70]:
b = pd.Series(a)

In [71]:
print(b[0])

[[1], 1, 2, 3, 4]

In [72]:
a = [1,2,3,4]

b = pd.Series(a,index=["x","y","k","z"])

In [73]:
b.x

1

In [74]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

In [75]:
d1 = pd.DataFrame(data)
d1

   calories  duration
0       420        50
1       380        40
2       390        45

In [76]:
d1.loc[[0,1,2]]

   calories  duration
0       420        50
1       380        40
2       390        45

In [77]:
df

   0
0  1
1  2
2  3
3  4

In [78]:
dff.max()

Index               397
Rank               Prof
Discipline            B
Yrs.since.phd        56
Yrs.service          60
Sex                Male
Salary           231545
dtype: object

In [79]:
dff.mean()

C:\Users\suman\AppData\Local\Temp\ipykernel_18104\3650115929.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  dff.mean()

Index               199.000000
Yrs.since.phd        22.314861
Yrs.service          17.614610
Salary           113706.458438
dtype: float64

In [80]:
dff.min()

Index                    1
Rank             AssocProf
Discipline               A
Yrs.since.phd            1
Yrs.service              0
Sex                 Female
Salary               57800
dtype: object

In [82]:
>>> mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
...           {'a': 100, 'b': 200, 'c': 300, 'd': 400},
...           {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000 }]
>>> df = pd.DataFrame(mydict)
>>> df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [85]:
>>> df.iloc[1]

a    100
b    200
c    300
d    400
Name: 1, dtype: int64